Reports/РезультатыМатчей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Report>
		<Properties>
			<Name>РезультатыМатчей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Чемпионат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Чемпионаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ТурнирнаяТаблица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ТурнирнаяТаблица</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоГолов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОчков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Туры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ПеремещенияИгроков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПеремещенияИгроков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Амплуа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Амплуа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Матч.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>Матч</Name>
			<BasedOn>
				<xr:Item>Catalog.Стадионы</xr:Item>
				<xr:Item>Catalog.Команды</xr:Item>
				<xr:Item>Catalog.Туры</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТурнирнаяТаблица</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Туры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стадион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Стадионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗрителей</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗрителей</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоГолов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пенальти</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставыКоманд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Игрок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Лига.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Лига</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыСпорта</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Страны</xr:Item>
				<xr:Item>Catalog.ВидыСпорта</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоКоманд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРотация</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОлимпийскаяСистема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квалификация</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Чемпионаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Чемпионаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Лига</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Лига</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/РезультатыМатчей/Ext/ObjectModule.bsl
Функция ОтчетСформировать() Экспорт
	ТабДокумент = Новый ТабличныйДокумент;
	
	Лига	= Чемпионат.Владелец;
	
	ТабДокумент.Вывести(ЗаголовокПолучить(Лига));
	Макет  = ПолучитьОбщийМакет("ТурнирнаяТаблица");
	
	Выборка = СерверныйФункции.ТурнирнаяТаблица(Чемпионат);
	Запросы	= ДанныеПолучить();
	Данные	= Запросы.Получить(1).Выгрузить();
	Прогноз	= Запросы.Получить(4).Выгрузить();
	
	Итого	= Новый Структура("Место", 0);
	Команды	= Новый Массив;
	ТабДокумент.Вывести(Макет.ПолучитьОбласть("ШапкаР|НачалоП"));
	Пока Выборка.Следующий() Цикл
		Команды.Добавить(Выборка.Команда);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаР|Команда");
		ОбластьМакета.Параметры.Заполнить(Выборка);
		СерверныйФункции.КартинкаУстановить(ОбластьМакета, Выборка.Команда);
		ТабДокумент.Присоединить(ОбластьМакета);
	КонецЦикла;
	
	Выборка.Сбросить();
	Пока Выборка.Следующий() Цикл
		Итого.Место	= Итого.Место + 1;
		ОбластьМакета = Макет.ПолучитьОбласть("ДеталиР|НачалоП");
		ОбластьМакета.Параметры.Заполнить(Выборка);
		СерверныйФункции.КартинкаУстановить(ОбластьМакета, Выборка.Команда);
		ОбластьМакета.Параметры.Место	= Итого.Место;
		ТабДокумент.Вывести(ОбластьМакета);
		
		Для Каждого Противник Из Команды Цикл
			Если Выборка.Команда = Противник Тогда
				ТабДокумент.Присоединить(Макет.ПолучитьОбласть("Пятерка|Команда"));
			Иначе
				Матчи		= Данные.НайтиСтроки(Новый Структура("Команда,Противник", Выборка.Команда, Противник));
				Если Матчи.Количество() = 0 Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("ДеталиР|Команда");
				Иначе
					ОбластьМакета = Макет.ПолучитьОбласть("ДеталиР|NN");
					Расшифровка	= Новый Структура("Счет,Регистратор", "");
					Матч = Матчи.Получить(0);
					Если Матч.Проведен Тогда
						Если Матч.КоличествоОчков >= 2 Тогда
							ОбластьМакета = Макет.ПолучитьОбласть("ДеталиР|WW");
						ИначеЕсли Матч.КоличествоОчков = 0 Тогда
							ОбластьМакета = Макет.ПолучитьОбласть("ДеталиР|LL");
						КонецЕсли;
						Расшифровка.Счет = СтрШаблон("%1-%2", Матч.КоличествоЗабито, Матч.КоличествоПропущено);
						Расшифровка.Регистратор	= Матч.Матч;
					Иначе
						ОбластьМакета = Макет.ПолучитьОбласть("ДеталиР|Команда");
						Встречи = Прогноз.НайтиСтроки(Новый Структура("Матч", Матч.Матч));
						Если Встречи.Количество() > 0 Тогда
							Встреча = Встречи.Получить(0);
							Если Встреча.КоличествоОчков >= 2 Тогда
								ОбластьМакета = Макет.ПолучитьОбласть("ДеталиР|Команда3");
							ИначеЕсли Встреча.КоличествоОчков = 0 Тогда
								ОбластьМакета = Макет.ПолучитьОбласть("ДеталиР|Команда0");
							КонецЕсли;
						КонецЕсли;
						Расшифровка.Счет = Формат(Матч.Дата, "ДФ=dd.MM");
						Расшифровка.Регистратор	= Матч.Матч;
					КонецЕсли;
					ОбластьМакета.Параметры.Заполнить(Расшифровка);
					Данные.Удалить(Матч);
				КонецЕсли;
				ТабДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	ТабДокумент.ФиксацияСверху	= 3;
	
	Возврат ТабДокумент;
КонецФункции

Функция ДанныеПолучить()
	Запрос	= Новый Запрос(
	"ВЫБРАТЬ
	|	МатчКоманды.Команда КАК Команда,
	|	ЕСТЬNULL(Топы.Корреляция, 0) КАК Корреляция,
	|	Противники.Команда КАК Противник,
	|	НАЧАЛОПЕРИОДА(МатчКоманды.Ссылка.Дата, ДЕНЬ) КАК Дата,
	|	МатчКоманды.Ссылка КАК Матч,
	|	МатчКоманды.Ссылка.Проведен КАК Проведен,
	|	МатчКоманды.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ТурнирнаяТаблица.КоличествоОчков, -1) КАК КоличествоОчков,
	|	МатчКоманды.КоличествоГолов КАК КоличествоЗабито,
	|	Противники.КоличествоГолов КАК КоличествоПропущено
	|ПОМЕСТИТЬ МатчКоманды
	|ИЗ
	|	Документ.Матч.Команды КАК МатчКоманды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	|		ПО МатчКоманды.Ссылка = ТурнирнаяТаблица.Регистратор
	|			И МатчКоманды.Команда = ТурнирнаяТаблица.Команда
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ЛигаКоманды.Команда КАК Команда,
	|			1 КАК Корреляция
	|		ИЗ
	|			Справочник.Лига.Команды КАК ЛигаКоманды
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
	|				ПО ЛигаКоманды.Ссылка = Чемпионаты.Владелец
	|		ГДЕ
	|			Чемпионаты.Ссылка = &Чемпионат) КАК Топы
	|		ПО МатчКоманды.Команда = Топы.Команда
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.Команды КАК Противники
	|		ПО МатчКоманды.Ссылка = Противники.Ссылка
	|			И МатчКоманды.НомерСтроки <> Противники.НомерСтроки
	|ГДЕ
	|	МатчКоманды.Ссылка.Тур.Владелец = &Чемпионат
	|	И МатчКоманды.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И МатчКоманды.Ссылка В
	|			(ВЫБРАТЬ
	|				МатчКоманды.Ссылка
	|			ИЗ
	|				Документ.Матч.Команды КАК МатчКоманды
	|			ГДЕ
	|				МатчКоманды.Ссылка.Тур.Владелец = &Чемпионат
	|			СГРУППИРОВАТЬ ПО
	|				МатчКоманды.Ссылка
	|			ИМЕЮЩИЕ
	|				МАКСИМУМ(МатчКоманды.НомерСтроки) = 2)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МатчКоманды.Команда КАК Команда,
	|	МатчКоманды.Противник КАК Противник,
	|	МатчКоманды.Дата КАК Дата,
	|	МатчКоманды.Матч КАК Матч,
	|	МатчКоманды.Проведен КАК Проведен,
	|	МатчКоманды.КоличествоОчков КАК КоличествоОчков,
	|	МатчКоманды.КоличествоЗабито КАК КоличествоЗабито,
	|	МатчКоманды.КоличествоПропущено КАК КоличествоПропущено
	|ИЗ
	|	МатчКоманды КАК МатчКоманды
	|ГДЕ
	|	МатчКоманды.НомерСтроки = 1
	|
	|УПОРЯДОЧИТЬ ПО
	|	Команда,
	|	Проведен УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПеремещенияИгроков.Игрок КАК Игрок,
	|	ПеремещенияИгроков.Игрок.ДатаРождения КАК ДатаРождения,
	|	ПеремещенияИгроков.Команда КАК Команда,
	|	ВЫБОР
	|		КОГДА (МатчСоставыКоманд.Игрок ЕСТЬ NULL) = ЛОЖЬ
	|			ТОГДА 2
	|		КОГДА ПеремещенияИгроков.Игрок.ПометкаУдаления = ЛОЖЬ
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Порядок
	|ПОМЕСТИТЬ Игроки
	|ИЗ
	|	РегистрСведений.ПеремещенияИгроков.СрезПоследних(&Дата, ГОД(Игрок.ДатаРождения) >= 1900) КАК ПеремещенияИгроков
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МатчСоставыКоманд.Игрок КАК Игрок,
	|			МатчСоставыКоманд.Команда КАК Команда
	|		ИЗ
	|			Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
	|		ГДЕ
	|			(МатчСоставыКоманд.Ссылка.Дата, МатчСоставыКоманд.Команда) В
	|					(ВЫБРАТЬ
	|						МАКСИМУМ(Составы.Ссылка.Дата),
	|						Составы.Команда
	|					ИЗ
	|						Документ.Матч.СоставыКоманд КАК Составы
	|					ГДЕ
	|						Составы.Ссылка.Тур.Владелец = &Чемпионат
	|					СГРУППИРОВАТЬ ПО
	|						Составы.Команда
	|					ИМЕЮЩИЕ
	|						КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Составы.Игрок) >= 11)
	|			И МатчСоставыКоманд.Игрок.ПометкаУдаления = ЛОЖЬ) КАК МатчСоставыКоманд
	|		ПО ПеремещенияИгроков.Игрок = МатчСоставыКоманд.Игрок
	|			И ПеремещенияИгроков.Команда = МатчСоставыКоманд.Команда
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МатчКоманды КАК МатчКоманды
	|		ПО ПеремещенияИгроков.Команда = МатчКоманды.Команда
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Команда КАК Команда,
	|	ВТ.Игрок КАК Игрок,
	|	ВТ.Корреляция КАК Корреляция,
	|	ВЫБОР
	|		КОГДА ВТ.Фаза1 <= 23 / 4
	|			ТОГДА ВТ.Фаза1 * 25 / 23
	|		КОГДА ВТ.Фаза1 <= 23 / 2
	|			ТОГДА (23 / 4 - (ВТ.Фаза1 - 23 / 4)) * 25 / 23
	|		КОГДА ВТ.Фаза1 <= 23 / 4 * 3
	|			ТОГДА -(ВТ.Фаза1 - 23 / 2) * 25 / 23
	|		ИНАЧЕ -(23 / 4 - (ВТ.Фаза1 - 23 / 4 * 3)) * 25 / 23
	|	КОНЕЦ КАК Фаза1,
	|	ВЫБОР
	|		КОГДА ВТ.Фаза2 <= 28 / 4
	|			ТОГДА ВТ.Фаза2 * 25 / 28
	|		КОГДА ВТ.Фаза2 <= 28 / 2
	|			ТОГДА (28 / 4 - (ВТ.Фаза2 - 28 / 4)) * 25 / 28
	|		КОГДА ВТ.Фаза2 <= 28 / 4 * 3
	|			ТОГДА -(ВТ.Фаза2 - 28 / 2) * 25 / 28
	|		ИНАЧЕ -(28 / 4 - (ВТ.Фаза2 - 28 / 4 * 3)) * 25 / 28
	|	КОНЕЦ КАК Фаза2,
	|	ВЫБОР
	|		КОГДА ВТ.Фаза3 <= 33 / 4
	|			ТОГДА ВТ.Фаза3 * 25 / 33
	|		КОГДА ВТ.Фаза3 <= 33 / 2
	|			ТОГДА (33 / 4 - (ВТ.Фаза3 - 33 / 4)) * 25 / 33
	|		КОГДА ВТ.Фаза3 <= 33 / 4 * 3
	|			ТОГДА -(ВТ.Фаза3 - 33 / 2) * 25 / 33
	|		ИНАЧЕ -(33 / 4 - (ВТ.Фаза3 - 33 / 4 * 3)) * 25 / 33
	|	КОНЕЦ КАК Фаза3,
	|	ВТ.Матч КАК Матч
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Клубы.Команда КАК Команда,
	|		ВЫБОР
	|			КОГДА Клубы.НомерСтроки = 1
	|				ТОГДА 9.34
	|			ИНАЧЕ 9
	|		КОНЕЦ + Клубы.Корреляция КАК Корреляция,
	|		Игроки.Игрок КАК Игрок,
	|		РАЗНОСТЬДАТ(Игроки.ДатаРождения, Клубы.Дата, ДЕНЬ) - 23 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, Клубы.Дата, ДЕНЬ) / 23) КАК Фаза1,
	|		РАЗНОСТЬДАТ(Игроки.ДатаРождения, Клубы.Дата, ДЕНЬ) - 28 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, Клубы.Дата, ДЕНЬ) / 28) КАК Фаза2,
	|		РАЗНОСТЬДАТ(Игроки.ДатаРождения, Клубы.Дата, ДЕНЬ) - 33 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, Клубы.Дата, ДЕНЬ) / 33) КАК Фаза3,
	|		Клубы.Матч КАК Матч
	|	ИЗ
	|		Игроки КАК Игроки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ МатчКоманды КАК Клубы
	|			ПО Игроки.Команда = Клубы.Команда
	|	ГДЕ
	|		Клубы.Проведен = ЛОЖЬ
	|		И (Игроки.Команда, Игроки.Порядок) В
	|				(ВЫБРАТЬ
	|					Игроки.Команда,
	|					МАКСИМУМ(Игроки.Порядок)
	|				ИЗ
	|					Игроки
	|				СГРУППИРОВАТЬ ПО
	|					Игроки.Команда)) КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Матчи.Матч КАК Матч,
	|	ВЫБОР
	|		КОГДА ВТ.Фаза1 + ВТ.Фаза2 + ВТ.Фаза3 + ВТ.Корреляция - ВТ2.Фаза1 - ВТ2.Фаза2 - ВТ2.Фаза3 - ВТ2.Корреляция >= 5
	|			ТОГДА 3
	|		КОГДА ВТ.Фаза1 + ВТ.Фаза2 + ВТ.Фаза3 + ВТ.Корреляция - ВТ2.Фаза1 - ВТ2.Фаза2 - ВТ2.Фаза3 - ВТ2.Корреляция <= -5
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоличествоОчков
	|ИЗ
	|	МатчКоманды КАК Матчи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТ.Матч КАК Матч,
	|			ВТ.Команда КАК Команда,
	|			СРЕДНЕЕ(ВТ.Корреляция + ВТ.Фаза1) КАК Фаза1,
	|			СРЕДНЕЕ(ВТ.Корреляция + ВТ.Фаза2 * 1.2) КАК Фаза2,
	|			СРЕДНЕЕ(ВТ.Корреляция + ВТ.Фаза3 * 1.1) КАК Фаза3,
	|			СУММА(ВЫБОР
	|					КОГДА ВТ.Фаза1 >= 1
	|							И ВТ.Фаза2 >= 1
	|							И ВТ.Фаза3 >= 1
	|						ТОГДА 1
	|					КОГДА ВТ.Фаза1 <= -1
	|							И ВТ.Фаза2 <= -1
	|							И ВТ.Фаза3 <= -1
	|						ТОГДА -1
	|					ИНАЧЕ 0
	|				КОНЕЦ) + ЦЕЛ(КОЛИЧЕСТВО(ВЫБОР
	|						КОГДА ВТ.Фаза1 > 0
	|								И ВТ.Фаза2 > 0
	|								И ВТ.Фаза3 > 0
	|							ТОГДА 1
	|						КОГДА ВТ.Фаза1 < 0
	|								И ВТ.Фаза2 < 0
	|								И ВТ.Фаза3 < 0
	|							ТОГДА -1
	|						ИНАЧЕ 0
	|					КОНЕЦ) * 0.34) КАК Корреляция
	|		ИЗ
	|			ВТ КАК ВТ
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ.Команда,
	|			ВТ.Матч) КАК ВТ
	|		ПО Матчи.Матч = ВТ.Матч
	|			И Матчи.Команда = ВТ.Команда
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МатчКоманды КАК Противники
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ВТ.Матч КАК Матч,
	|				ВТ.Команда КАК Команда,
	|				СРЕДНЕЕ(ВТ.Корреляция + ВТ.Фаза1) КАК Фаза1,
	|				СРЕДНЕЕ(ВТ.Корреляция + ВТ.Фаза2 * 1.2) КАК Фаза2,
	|				СРЕДНЕЕ(ВТ.Корреляция + ВТ.Фаза3 * 1.1) КАК Фаза3,
	|				СУММА(ВЫБОР
	|						КОГДА ВТ.Фаза1 > 0
	|								И ВТ.Фаза2 > 0
	|								И ВТ.Фаза3 > 0
	|							ТОГДА 1
	|						КОГДА ВТ.Фаза1 < 0
	|								И ВТ.Фаза2 < 0
	|								И ВТ.Фаза3 < 0
	|							ТОГДА -1
	|						ИНАЧЕ 0
	|					КОНЕЦ) + ЦЕЛ(КОЛИЧЕСТВО(ВЫБОР
	|							КОГДА ВТ.Фаза1 > 0
	|									И ВТ.Фаза2 > 0
	|									И ВТ.Фаза3 > 0
	|								ТОГДА 1
	|							КОГДА ВТ.Фаза1 < 0
	|									И ВТ.Фаза2 < 0
	|									И ВТ.Фаза3 < 0
	|								ТОГДА -1
	|							ИНАЧЕ 0
	|						КОНЕЦ) * 0.34) КАК Корреляция
	|			ИЗ
	|				ВТ КАК ВТ
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ВТ.Команда,
	|				ВТ.Матч) КАК ВТ2
	|			ПО Противники.Матч = ВТ2.Матч
	|				И Противники.Команда = ВТ2.Команда
	|		ПО Матчи.Матч = Противники.Матч
	|ГДЕ
	|	Матчи.НомерСтроки = 1
	|	И Матчи.Проведен = ЛОЖЬ
	|	И Противники.НомерСтроки = 2
	|
	|УПОРЯДОЧИТЬ ПО
	|	Матчи.Проведен УБЫВ,
	|	Матчи.Дата");
	Запрос.УстановитьПараметр("Чемпионат",			Чемпионат);
	Запрос.УстановитьПараметр("Дата",				НачалоДня(ТекущаяУниверсальнаяДата()));
	Возврат Запрос.ВыполнитьПакет();
КонецФункции

Функция ЗаголовокПолучить(Лига)
	Возврат СерверныйФункции.ЗаголовокПолучить(Новый Структура("Лига,Чемпионат,ВыводитьЧемпионат", Лига, Чемпионат, Ложь));
КонецФункции
